# ActiveFrameTime Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..ActiveFrameTime Property
SunAndShadowSettings Class See Also
---
Identifies the date and time of the SunAndShadowSettings element for the active frame.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public DateTime ActiveFrameTime { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActiveFrameTime As DateTime
	Get
```

Visual C++
---
```text
public:
property DateTime ActiveFrameTime {
	DateTime get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace